config.org
# -*- mode: org; -*-

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

#+AUTHOR: Anthony Kalaitzis
#+TITLE: Emacs Config file

* Emacs Utility
** Shell
Recognize exported paths in .bashrc
#+BEGIN_SRC emacs-lisp
(defun set-exec-path-from-shell-PATH ()
  (let ((path-from-shell (replace-regexp-in-string
                          "[ \t\n]*$"
                          ""
                          (shell-command-to-string "$SHELL --login -i -c 'echo $PATH'"))))
    (setenv "PATH" path-from-shell)
    (setq eshell-path-env path-from-shell) ; for eshell users
    (setq exec-path (split-string path-from-shell path-separator))))
(when window-system (set-exec-path-from-shell-PATH))

(global-set-key (kbd "H-S") 'window-split-toggle)
#+END_SRC

Add shell variables to emacs
#+BEGIN_SRC emacs-lisp
  (when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
#+END_SRC

** Language 

Enable quick changed between English and 日本語
#+BEGIN_SRC emacs-lisp
(set-language-environment "Japanese")
#+END_SRC

** Extra

Add custom abbrev definitions
#+BEGIN_SRC emacs-lisp
(setq abbrev-file-name "~/.abbrev_defs")
(if (file-exists-p abbrev-file-name)
    (quietly-read-abbrev-file))
#+END_SRC

Add some custom load paths
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/elpa/")
#+END_SRC

Toggle between splits
#+BEGIN_SRC emacs-lisp
  (defun window-split-toggle ()
  "Toggle between horizontal and vertical split with two windows."
  (interactive)
  (if (> (length (window-list)) 2)
      (error "Can't toggle with more than 2 windows!")
    (let ((func (if (window-full-height-p)
                    #'split-window-vertically
                  #'split-window-horizontally)))
      (delete-other-windows)
      (funcall func)
      (save-selected-window
        (other-window 1)
        (switch-to-buffer (other-buffer))))))
#+END_SRC

Auto refresh buffers without asking
#+BEGIN_SRC emacs-lisp
  (global-auto-revert-mode t)
#+END_SRC

* Quality of life changes
** Accessibility
Change text size in Emacs
#+BEGIN_SRC emacs-lisp
(set-face-attribute 'default nil :height 150)
#+END_SRC

camelCase recognition
#+BEGIN_SRC emacs-lisp
(global-subword-mode)
#+END_SRC

Turn on rainbow deliminators 
#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
(add-hook 'foo-mode-hook #'rainbow-delimiters-mode)
#+END_SRC

