config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-06 Mon 14:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Config file</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Anthony Kalaitzis" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Emacs Config file</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3a480b8">1. Emacs Utility</a>
<ul>
<li><a href="#org2536aed">1.1. Shell</a></li>
<li><a href="#orgffe2ce6">1.2. Language</a></li>
<li><a href="#org8c66791">1.3. Extra</a></li>
</ul>
</li>
<li><a href="#orge51be0c">2. Quality of life changes</a>
<ul>
<li><a href="#orgc3aa5bd">2.1. Accessibility</a></li>
<li><a href="#org506215a">2.2. Start up</a></li>
<li><a href="#orgd9eb280">2.3. Display and Utility</a></li>
</ul>
</li>
<li><a href="#org50d3b40">3. Key Re-bindings</a>
<ul>
<li><a href="#org1213dc6">3.1. File Navigation</a></li>
<li><a href="#org0ca8c92">3.2. Movement Macros</a></li>
<li><a href="#org8cd927b">3.3. Personal Macros</a></li>
<li><a href="#org7df62cc">3.4. Global coding macros</a></li>
</ul>
</li>
<li><a href="#orgce8b067">4. Helm</a></li>
<li><a href="#orgc6816dd">5. Colour Theme</a></li>
<li><a href="#orgf51857d">6. AucTex</a>
<ul>
<li><a href="#orgfd437dd">6.1. FlySpell</a></li>
<li><a href="#org868fd95">6.2. PDF Tools</a></li>
<li><a href="#org04e2814">6.3. Utility</a></li>
<li><a href="#org33727b6">6.4. LaTeX editing major mode</a></li>
</ul>
</li>
<li><a href="#org20216c1">7. Coding</a>
<ul>
<li><a href="#orga58d3b2">7.1. FORTRAN</a></li>
<li><a href="#orgbc61bae">7.2. Python</a></li>
<li><a href="#orgf3a03fc">7.3. C++</a></li>
<li><a href="#orgacaf4e8">7.4. Julia</a>
<ul>
<li><a href="#org8e4b799">7.4.1. Environment Macros</a></li>
<li><a href="#org1f20df1">7.4.2. Shell Configurations</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org094fffa">8. Org</a>
<ul>
<li><a href="#org1ecd6d6">8.1. Editing Code</a></li>
<li><a href="#org777e797">8.2. Capture Mode</a></li>
<li><a href="#org11a47e1">8.3. Macros</a></li>
<li><a href="#org80c7b0b">8.4. Utility</a></li>
<li><a href="#org2fe7a6c">8.5. Visual Settings</a></li>
<li><a href="#orge0c0ab5">8.6. Agenda alternations</a></li>
<li><a href="#org2f1e7bc">8.7. Beamer</a></li>
<li><a href="#org735aa9e">8.8. LaTeX</a></li>
</ul>
</li>
<li><a href="#org41e05c4">9. Wolfram Alpha</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3a480b8" class="outline-2">
<h2 id="org3a480b8"><span class="section-number-2">1</span> Emacs Utility</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2536aed" class="outline-3">
<h3 id="org2536aed"><span class="section-number-3">1.1</span> Shell</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Recognize exported paths in .bashrc
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">set-exec-path-from-shell-PATH</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">let</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>path-from-shell <span style="color: #FD971F;">(</span>replace-regexp-in-string
                          <span style="color: #ff00ff;">"[ \t\n]*$"</span>
                          <span style="color: #ff00ff;">""</span>
                          <span style="color: #F92672;">(</span>shell-command-to-string <span style="color: #ff00ff;">"$SHELL --login -i -c 'echo $PATH'"</span><span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span>setenv <span style="color: #ff00ff;">"PATH"</span> path-from-shell<span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> eshell-path-env path-from-shell<span style="color: #A6E22E;">)</span> <span style="color: #75715E;">; </span><span style="color: #999999; font-style: italic;">for eshell users</span>
    <span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> exec-path <span style="color: #E6DB74;">(</span>split-string path-from-shell path-separator<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">when</span> window-system <span style="color: #66D9EF;">(</span>set-exec-path-from-shell-PATH<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"H-S"</span><span style="color: #66D9EF;">)</span> 'window-split-toggle<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Add shell variables to emacs
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">when</span> <span style="color: #66D9EF;">(</span>memq window-system '<span style="color: #A6E22E;">(</span>mac ns x<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
<span style="color: #66D9EF;">(</span>exec-path-from-shell-initialize<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgffe2ce6" class="outline-3">
<h3 id="orgffe2ce6"><span class="section-number-3">1.2</span> Language</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Enable quick changed between English and 日本語
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>set-language-environment <span style="color: #ff00ff;">"Japanese"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c66791" class="outline-3">
<h3 id="org8c66791"><span class="section-number-3">1.3</span> Extra</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Add custom abbrev definitions
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> abbrev-file-name <span style="color: #ff00ff;">"~/.abbrev_defs"</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">if</span> <span style="color: #66D9EF;">(</span>file-exists-p abbrev-file-name<span style="color: #66D9EF;">)</span>
    <span style="color: #66D9EF;">(</span>quietly-read-abbrev-file<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Add some custom load paths
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-to-list 'load-path <span style="color: #ff00ff;">"~/.emacs.d/elpa/"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Toggle between splits
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">window-split-toggle</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
<span style="color: #E6DB74;">"Toggle between horizontal and vertical split with two windows."</span>
<span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #66D9EF;">)</span>
<span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">if</span> <span style="color: #A6E22E;">(</span>&gt; <span style="color: #E6DB74;">(</span>length <span style="color: #FD971F;">(</span>window-list<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span> 2<span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span><span style="color: #ffc0cb; font-weight: bold; font-style: italic; text-decoration: underline;">error</span> <span style="color: #ff00ff;">"Can't toggle with more than 2 windows!"</span><span style="color: #A6E22E;">)</span>
  <span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">let</span> <span style="color: #E6DB74;">(</span><span style="color: #FD971F;">(</span>func <span style="color: #F92672;">(</span><span style="color: #00ffff; font-weight: bold;">if</span> <span style="color: #AE81FF;">(</span>window-full-height-p<span style="color: #AE81FF;">)</span>
                  #'split-window-vertically
                #'split-window-horizontally<span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
    <span style="color: #E6DB74;">(</span>delete-other-windows<span style="color: #E6DB74;">)</span>
    <span style="color: #E6DB74;">(</span>funcall func<span style="color: #E6DB74;">)</span>
    <span style="color: #E6DB74;">(</span><span style="color: #00ffff; font-weight: bold;">save-selected-window</span>
      <span style="color: #FD971F;">(</span>other-window 1<span style="color: #FD971F;">)</span>
      <span style="color: #FD971F;">(</span>switch-to-buffer <span style="color: #F92672;">(</span>other-buffer<span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Auto refresh buffers without asking
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-auto-revert-mode t<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge51be0c" class="outline-2">
<h2 id="orge51be0c"><span class="section-number-2">2</span> Quality of life changes</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc3aa5bd" class="outline-3">
<h3 id="orgc3aa5bd"><span class="section-number-3">2.1</span> Accessibility</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Change text size in Emacs
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>set-face-attribute 'default nil <span style="color: #87ceeb;">:height</span> 150<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
camelCase recognition
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-subword-mode<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Turn on rainbow deliminators 
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-hook 'prog-mode-hook #'rainbow-delimiters-mode<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-hook 'foo-mode-hook #'rainbow-delimiters-mode<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
