config.org
** Start up

Auto full screen Emacs GUI
#+BEGIN_SRC emacs-lisp
(when (display-graphic-p)
  (add-to-list 'default-frame-alist '(fullscreen . maximized)))
#+END_SRC

Don't show scroll bar
#+BEGIN_SRC emacs-lisp
(tool-bar-mode 0)
(menu-bar-mode 0)
(when window-system
  (scroll-bar-mode -1))
#+END_SRC

turn off Emacs's annoying bell
#+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
#+END_SRC

Fix Scrolling behaviour
#+BEGIN_SRC emacs-lisp
(setq scroll-conservatively 100)
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) 
(setq mouse-wheel-progressive-speed nil)
(setq mouse-wheel-follow-mouse 't) 
#+END_SRC

Remove start up message
#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-message t)
(setq inhibit-startup-echo-area-message t)
#+END_SRC

Use better defaults for Emacs
#+BEGIN_SRC emacs-lisp
(require 'better-defaults)
#+END_SRC

** Display and Utility

Display time in mode line
#+BEGIN_SRC emacs-lisp
(setq display-time-string-forms '((propertize (format-time-string " %b %d, %l:%M%P" now) 'face'bold)))
(setq display-time-and-date t)
(display-time-mode 1)
#+END_SRC

Abbreviate all 'Yes/No' prompts to 'y/n'
#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

Display line numbers in programming modes
#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
#+END_SRC

* Key Re-bindings
** File Navigation

Enable quick access to config file
#+BEGIN_SRC emacs-lisp
(defun my/visit-emacs-config ()
  (interactive)
  (find-file "~/.emacs.d/config.org"))
(global-set-key (kbd "H-e") 'my/visit-emacs-config)
#+END_SRC

File navigation for major files
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "H-r")  (lambda () (interactive) (find-file  "~/Dropbox/QMC/Thesis/MPhil_Research.tex")))
(global-set-key (kbd "H-j")  (lambda () (interactive) (find-file  "~/Dropbox/Journal/journal.org")))
(global-set-key (kbd "H-a")  (lambda () (interactive) (find-file  "~/Dropbox/Journal/agenda.org")))
(global-set-key (kbd "H-w")  (lambda () (interactive) (find-file  "~/Dropbox/QMC/My_QMC_Research/QMC_2018V2.f90")))
(global-set-key (kbd "H-t")  (lambda () (interactive) (find-file  "~/texmf/tex/latex/package_repository/mypackage.sty")))
#+END_SRC

** Movement Macros

Move between buffers in same frame
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-]") 'other-window)
#+END_SRC

Move between buffers in different frames
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-[") 'other-frame)
#+END_SRC

Move in paragraphs
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-n") 'forward-paragraph)
(global-set-key (kbd "M-p") 'backward-paragraph)
#+END_SRC

ace window movement key bindings
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "H-A") 'ace-window)
#+END_SRC

** Personal Macros

Binding for Helm Spotify inside Emacs
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "H-s") 'helm-spotify-plus)
#+END_SRC

