config.html

<div id="outline-container-org506215a" class="outline-3">
<h3 id="org506215a"><span class="section-number-3">2.2</span> Start up</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Auto full screen Emacs GUI
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">when</span> <span style="color: #66D9EF;">(</span>display-graphic-p<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>add-to-list 'default-frame-alist '<span style="color: #A6E22E;">(</span>fullscreen . maximized<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Don&rsquo;t show scroll bar
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>tool-bar-mode 0<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>menu-bar-mode 0<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">when</span> window-system
  <span style="color: #66D9EF;">(</span>scroll-bar-mode -1<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
turn off Emacs&rsquo;s annoying bell
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> ring-bell-function 'ignore<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Fix Scrolling behaviour
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> scroll-conservatively 100<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> mouse-wheel-scroll-amount '<span style="color: #66D9EF;">(</span>1 <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>shift<span style="color: #E6DB74;">)</span> . 1<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> 
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> mouse-wheel-progressive-speed nil<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> mouse-wheel-follow-mouse 't<span style="color: #AE81FF;">)</span> 
</pre>
</div>

<p>
Remove start up message
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> inhibit-startup-message t<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> inhibit-startup-echo-area-message t<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Use better defaults for Emacs
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #ee2c2c;">better-defaults</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9eb280" class="outline-3">
<h3 id="orgd9eb280"><span class="section-number-3">2.3</span> Display and Utility</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Display time in mode line
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> display-time-string-forms '<span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>propertize <span style="color: #E6DB74;">(</span>format-time-string <span style="color: #ff00ff;">" %b %d, %l:%M%P"</span> now<span style="color: #E6DB74;">)</span> 'face'bold<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> display-time-and-date t<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>display-time-mode 1<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Abbreviate all &rsquo;Yes/No&rsquo; prompts to &rsquo;y/n&rsquo;
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>fset 'yes-or-no-p 'y-or-n-p<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Display line numbers in programming modes
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-hook 'prog-mode-hook 'display-line-numbers-mode<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org50d3b40" class="outline-2">
<h2 id="org50d3b40"><span class="section-number-2">3</span> Key Re-bindings</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org1213dc6" class="outline-3">
<h3 id="org1213dc6"><span class="section-number-3">3.1</span> File Navigation</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Enable quick access to config file
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">my/visit-emacs-config</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>find-file <span style="color: #ff00ff;">"~/.emacs.d/config.org"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"H-e"</span><span style="color: #66D9EF;">)</span> 'my/visit-emacs-config<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
File navigation for major files
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"H-r"</span><span style="color: #66D9EF;">)</span>  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">lambda</span> <span style="color: #A6E22E;">(</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span>find-file  <span style="color: #ff00ff;">"~/Dropbox/QMC/Thesis/MPhil_Research.tex"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"H-j"</span><span style="color: #66D9EF;">)</span>  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">lambda</span> <span style="color: #A6E22E;">(</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span>find-file  <span style="color: #ff00ff;">"~/Dropbox/Journal/journal.org"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"H-a"</span><span style="color: #66D9EF;">)</span>  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">lambda</span> <span style="color: #A6E22E;">(</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span>find-file  <span style="color: #ff00ff;">"~/Dropbox/Journal/agenda.org"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"H-w"</span><span style="color: #66D9EF;">)</span>  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">lambda</span> <span style="color: #A6E22E;">(</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span>find-file  <span style="color: #ff00ff;">"~/Dropbox/QMC/My_QMC_Research/QMC_2018.f90"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"H-t"</span><span style="color: #66D9EF;">)</span>  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">lambda</span> <span style="color: #A6E22E;">(</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span>find-file  <span style="color: #ff00ff;">"~/texmf/tex/latex/package_repository/mypackage.sty"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ca8c92" class="outline-3">
<h3 id="org0ca8c92"><span class="section-number-3">3.2</span> Movement Macros</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Move between buffers in same frame
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"M-]"</span><span style="color: #66D9EF;">)</span> 'other-window<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Move between buffers in different frames
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"M-["</span><span style="color: #66D9EF;">)</span> 'other-frame<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Move in paragraphs
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"M-n"</span><span style="color: #66D9EF;">)</span> 'forward-paragraph<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"M-p"</span><span style="color: #66D9EF;">)</span> 'backward-paragraph<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
ace window movement key bindings
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"H-A"</span><span style="color: #66D9EF;">)</span> 'ace-window<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cd927b" class="outline-3">
<h3 id="org8cd927b"><span class="section-number-3">3.3</span> Personal Macros</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Binding for Helm Spotify inside Emacs
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"H-s"</span><span style="color: #66D9EF;">)</span> 'helm-spotify-plus<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
