config.org
** Global coding macros

Repeat previous shell command
#+BEGIN_SRC emacs-lisp
(defun my/repeat-last-shell-command()
  "repeats last run shell command"
  (interactive)
  (shell-command (cadr (assoc 'shell-command command-history))))
(global-set-key (kbd "M-Z") 'my/repeat-last-shell-command)
#+END_SRC

Exchange below and above lines globally
#+BEGIN_SRC emacs-lisp
(defun move-line-up ()
  (interactive)
  (transpose-lines 1)
  (previous-line 2))

(defun move-line-down ()
  (interactive)
  (forward-line 1)
  (transpose-lines 1)
  (previous-line 1))

(global-set-key (kbd "M-<up>") 'move-line-up)
(global-set-key (kbd "M-<down>") 'move-line-down)
#+END_SRC

* Helm

Major configurations for the Helm Plugin
#+BEGIN_SRC emacs-lisp
(helm-mode 1)
(require 'helm)
(require 'helm-config)
(global-set-key (kbd "M-x") 'helm-M-x)
(global-set-key (kbd "C-x C-f") 'helm-find-files)
(global-set-key (kbd "C-x C-b") 'helm-buffers-list)
#+END_SRC

Turn on Helm Spotify
#+BEGIN_SRC emacs-lisp
(require 'helm-spotify-plus)
#+END_SRC

* Colour Theme

Load in custom colour theme
#+BEGIN_SRC emacs-lisp
(add-to-list 'custom-theme-load-path "~/.emacs.d/anthony-swanking-theme")
(load-theme 'anthony-swanking t)
#+END_SRC

* AucTex
** FlySpell

Enable spell checking for LaTex
#+BEGIN_SRC emacs-lisp
(dolist (hook '(text-mode-hook))
  (add-hook hook (lambda () (flyspell-mode 1))))
#+END_SRC

** PDF Tools

Better PDF viewing inside AucTex
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-view-mode))
(setq pdf-view-midnight-colors (cons (face-foreground 'default) (face-background 'default)))

(defun my-pdf-view-mode-hook ()
  (pdf-view-midnight-minor-mode 1)
  (linum-mode 0)
  )
(add-hook 'pdf-view-mode-hook 'my-pdf-view-mode-hook)
(pdf-tools-install)

(setq TeX-view-program-selection '((output-pdf "PDF Tools"))
      TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view))
      TeX-source-correlate-start-server t)
#+END_SRC

** Utility

Refresh the buffer after compilation
#+BEGIN_SRC emacs-lisp
(add-hook 'TeX-after-compilation-finished-functions
	  #'TeX-revert-document-buffer)
#+END_SRC

