config.html

<div id="outline-container-org7df62cc" class="outline-3">
<h3 id="org7df62cc"><span class="section-number-3">3.4</span> Global coding macros</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Repeat previous shell command
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">my/repeat-last-shell-command</span><span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #E6DB74;">"repeats last run shell command"</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>shell-command <span style="color: #A6E22E;">(</span>cadr <span style="color: #E6DB74;">(</span>assoc 'shell-command command-history<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"M-Z"</span><span style="color: #66D9EF;">)</span> 'my/repeat-last-shell-command<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Exchange below and above lines globally
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">move-line-up</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>transpose-lines 1<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>previous-line 2<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">move-line-down</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>forward-line 1<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>transpose-lines 1<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>previous-line 1<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"M-&lt;up&gt;"</span><span style="color: #66D9EF;">)</span> 'move-line-up<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"M-&lt;down&gt;"</span><span style="color: #66D9EF;">)</span> 'move-line-down<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgce8b067" class="outline-2">
<h2 id="orgce8b067"><span class="section-number-2">4</span> Helm</h2>
<div class="outline-text-2" id="text-4">
<p>
Major configurations for the Helm Plugin
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>helm-mode 1<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #ee2c2c;">helm</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #ee2c2c;">helm-config</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"M-x"</span><span style="color: #66D9EF;">)</span> 'helm-M-x<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"C-x C-f"</span><span style="color: #66D9EF;">)</span> 'helm-find-files<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"C-x C-b"</span><span style="color: #66D9EF;">)</span> 'helm-buffers-list<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Turn on Helm Spotify
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #ee2c2c;">helm-spotify-plus</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc6816dd" class="outline-2">
<h2 id="orgc6816dd"><span class="section-number-2">5</span> Colour Theme</h2>
<div class="outline-text-2" id="text-5">
<p>
Load in custom colour theme
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-to-list 'custom-theme-load-path <span style="color: #ff00ff;">"~/.emacs.d/anthony-swanking-theme"</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>load-theme 'anthony-swanking t<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf51857d" class="outline-2">
<h2 id="orgf51857d"><span class="section-number-2">6</span> AucTex</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgfd437dd" class="outline-3">
<h3 id="orgfd437dd"><span class="section-number-3">6.1</span> FlySpell</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Enable spell checking for LaTex
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">dolist</span> <span style="color: #66D9EF;">(</span>hook '<span style="color: #A6E22E;">(</span>text-mode-hook<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>add-hook hook <span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">lambda</span> <span style="color: #E6DB74;">(</span><span style="color: #E6DB74;">)</span> <span style="color: #E6DB74;">(</span>flyspell-mode 1<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org868fd95" class="outline-3">
<h3 id="org868fd95"><span class="section-number-3">6.2</span> PDF Tools</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Better PDF viewing inside AucTex
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-to-list 'auto-mode-alist '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"\\.pdf\\'"</span> . pdf-view-mode<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> pdf-view-midnight-colors <span style="color: #66D9EF;">(</span>cons <span style="color: #A6E22E;">(</span>face-foreground 'default<span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span>face-background 'default<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">my-pdf-view-mode-hook</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>pdf-view-midnight-minor-mode 1<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>linum-mode 0<span style="color: #66D9EF;">)</span>
  <span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-hook 'pdf-view-mode-hook 'my-pdf-view-mode-hook<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>pdf-tools-install<span style="color: #AE81FF;">)</span>

<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> TeX-view-program-selection '<span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>output-pdf <span style="color: #ff00ff;">"PDF Tools"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
      TeX-view-program-list '<span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span><span style="color: #ff00ff;">"PDF Tools"</span> TeX-pdf-tools-sync-view<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
      TeX-source-correlate-start-server t<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org04e2814" class="outline-3">
<h3 id="org04e2814"><span class="section-number-3">6.3</span> Utility</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Refresh the buffer after compilation
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-hook 'TeX-after-compilation-finished-functions
          #'TeX-revert-document-buffer<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
