config.html

<div id="outline-container-org33727b6" class="outline-3">
<h3 id="org33727b6"><span class="section-number-3">6.4</span> LaTeX editing major mode</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #ee2c2c;">tex</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-hook 'LaTeX-mode-hook 'my-LaTeX-mode-hook<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">my-LaTeX-mode-hook</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> TeX-auto-save t<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> TeX-parse-self t<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">setq-default</span> TeX-master nil<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> TeX-PDF-mode t<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>visual-line-mode 1<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>flyspell-mode 1<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>LaTeX-math-mode 1<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>TeX-source-correlate-mode 1<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>outline-minor-mode 1<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>local-set-key <span style="color: #A6E22E;">(</span>kbd <span style="color: #ff00ff;">"C-M-="</span><span style="color: #A6E22E;">)</span> '<span style="color: #A6E22E;">(</span>lambda <span style="color: #E6DB74;">(</span><span style="color: #E6DB74;">)</span> <span style="color: #E6DB74;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #E6DB74;">)</span> <span style="color: #E6DB74;">(</span>insert <span style="color: #ff00ff;">"&amp;= "</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>local-set-key <span style="color: #A6E22E;">(</span>kbd <span style="color: #ff00ff;">"C-H-f"</span><span style="color: #A6E22E;">)</span> '<span style="color: #A6E22E;">(</span>lambda <span style="color: #E6DB74;">(</span><span style="color: #E6DB74;">)</span> <span style="color: #E6DB74;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #E6DB74;">)</span> <span style="color: #E6DB74;">(</span>insert <span style="color: #ff00ff;">"frac{"</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>local-set-key <span style="color: #A6E22E;">(</span>kbd <span style="color: #ff00ff;">"C-c b"</span><span style="color: #A6E22E;">)</span> 'tex-latex-block<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>local-set-key <span style="color: #A6E22E;">(</span>kbd <span style="color: #ff00ff;">"&lt;C-tab&gt;"</span><span style="color: #A6E22E;">)</span> 'outline-toggle-children<span style="color: #66D9EF;">)</span>
  <span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org20216c1" class="outline-2">
<h2 id="org20216c1"><span class="section-number-2">7</span> Coding</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orga58d3b2" class="outline-3">
<h3 id="orga58d3b2"><span class="section-number-3">7.1</span> FORTRAN</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Auto load in FORTRAN mode for f90 files
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>autoload 'f90-mode <span style="color: #ff00ff;">"f90"</span> <span style="color: #E6DB74;">"Fortran 90 mode"</span> t<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Configurations for FORTRAN major mode
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-hook 'f90-mode-hook 'my-f90-mode-hook<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #ee2c2c;">fortran</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">my-f90-mode-hook</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span> 
  <span style="color: #66D9EF;">(</span>local-set-key <span style="color: #A6E22E;">(</span>kbd <span style="color: #ff00ff;">"H-M-c"</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">lambda</span> <span style="color: #E6DB74;">(</span><span style="color: #E6DB74;">)</span> <span style="color: #E6DB74;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #E6DB74;">)</span> <span style="color: #E6DB74;">(</span>shell-command <span style="color: #ff00ff;">"./bash_fortran"</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>local-set-key <span style="color: #A6E22E;">(</span>kbd <span style="color: #ff00ff;">"H-t"</span><span style="color: #A6E22E;">)</span> 'my/f90-comment-header-block<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> f90-font-lock-keywords f90-font-lock-keywords-3<span style="color: #66D9EF;">)</span>
  '<span style="color: #66D9EF;">(</span>f90-comment-region <span style="color: #ff00ff;">"!!!$"</span><span style="color: #66D9EF;">)</span>
  '<span style="color: #66D9EF;">(</span>f90-indented-comment-re <span style="color: #ff00ff;">"!"</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>abbrev-mode 1<span style="color: #66D9EF;">)</span>                     
  <span style="color: #66D9EF;">(</span>turn-on-font-lock<span style="color: #66D9EF;">)</span>                 
  <span style="color: #66D9EF;">(</span>auto-fill-mode 0<span style="color: #66D9EF;">)</span>                  
<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Creates a heading in FORTRAN major mode
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">my/f90-comment-header-block</span> <span style="color: #66D9EF;">(</span>title<span style="color: #66D9EF;">)</span>
  <span style="color: #E6DB74;">"Inserts a commented title block for f90"</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span> <span style="color: #ff00ff;">"sEnter a title: "</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">defvar</span> <span style="color: #ffc125;">blank-len</span> 1<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> blank-len <span style="color: #A6E22E;">(</span>/ <span style="color: #E6DB74;">(</span>- 69 <span style="color: #FD971F;">(</span>length title<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span> 2<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>newline<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">dotimes</span> <span style="color: #A6E22E;">(</span>jj 5<span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">case</span> jj
      <span style="color: #E6DB74;">(</span><span style="color: #FD971F;">(</span>0 4<span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span>indent-for-tab-command<span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span>insert <span style="color: #ff00ff;">"!"</span><span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span><span style="color: #00ffff; font-weight: bold;">dotimes</span> <span style="color: #F92672;">(</span>ii 69<span style="color: #F92672;">)</span> <span style="color: #F92672;">(</span>insert <span style="color: #ff00ff;">"-"</span><span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span>insert <span style="color: #ff00ff;">"!"</span><span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span>newline<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
      <span style="color: #E6DB74;">(</span><span style="color: #FD971F;">(</span>1 3<span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span>indent-for-tab-command<span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span>insert <span style="color: #ff00ff;">"!"</span><span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span><span style="color: #00ffff; font-weight: bold;">dotimes</span> <span style="color: #F92672;">(</span>ii 69<span style="color: #F92672;">)</span> <span style="color: #F92672;">(</span>insert <span style="color: #ff00ff;">" "</span><span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span>insert <span style="color: #ff00ff;">"!"</span><span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span>newline<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
      <span style="color: #E6DB74;">(</span>2
       <span style="color: #FD971F;">(</span>indent-for-tab-command<span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span>insert <span style="color: #ff00ff;">"!"</span><span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span><span style="color: #00ffff; font-weight: bold;">dotimes</span> <span style="color: #F92672;">(</span>ii blank-len<span style="color: #F92672;">)</span>
         <span style="color: #F92672;">(</span>insert <span style="color: #ff00ff;">" "</span><span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span><span style="color: #00ffff; font-weight: bold;">if</span> <span style="color: #F92672;">(</span>= <span style="color: #AE81FF;">(</span>mod <span style="color: #66D9EF;">(</span>length title<span style="color: #66D9EF;">)</span> 2<span style="color: #AE81FF;">)</span> 0<span style="color: #F92672;">)</span>
           <span style="color: #F92672;">(</span>insert <span style="color: #ff00ff;">" "</span><span style="color: #F92672;">)</span>
         <span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span>insert title<span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span><span style="color: #00ffff; font-weight: bold;">dotimes</span> <span style="color: #F92672;">(</span>ii blank-len<span style="color: #F92672;">)</span>
         <span style="color: #F92672;">(</span>insert <span style="color: #ff00ff;">" "</span><span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span>insert <span style="color: #ff00ff;">"!"</span><span style="color: #FD971F;">)</span>
       <span style="color: #FD971F;">(</span>newline<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
  <span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"H-Z"</span><span style="color: #66D9EF;">)</span> 'my/f90-comment-header-block<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
