config.org
** Python

Insert a template for a python document
#+BEGIN_SRC emacs-lisp
  (add-hook 'find-file-hooks 'my/template-insert-python)
  (defun my/template-insert-python()
    (interactive)
    (when (and
    (string-match "\\.py$" (buffer-file-name))
    (eq 1 (point-max)))
    (insert-file "~/Dropbox/Templates/python_template.py")))    
#+END_SRC

Some configurations Python major mode
#+BEGIN_SRC emacs-lisp
  (require 'python)
  (add-hook 'python-mode-hook 'my-python-mode-hook)
  (defun my-python-mode-hook()     
    (setq python-shell-interpreter "ipython"
          python-shell-interpreter-args "--simple-prompt -i")
    (add-to-list 'load-path "/folder/containing/file")
    )
#+END_SRC

** C++

Load in C++ major mode for .h files
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
#+END_SRC

Insert a template for a C++ document
#+BEGIN_SRC emacs-lisp
  (add-hook 'find-file-hooks 'my/template-insert-C++)
  (defun my/template-insert-C++()
    (interactive)
    (when (and
    (string-match "\\.cpp$" (buffer-file-name))
    (eq 1 (point-max)))
    (insert-file "~/Dropbox/Templates/c++template.cpp")))    
#+END_SRC

Some configurations C++ major mode
#+BEGIN_SRC emacs-lisp
(require 'cl)
(add-hook 'c++-mode-hook 'my-c++-mode-hook)
(defun my-c++-mode-hook ()
  (local-set-key (kbd "H-M-p")(lambda () (interactive) (shell-command "./bash_c++")))
  )
#+END_SRC

** Julia
*** Environment Macros

Some configurations Julia major mode
#+BEGIN_SRC emacs-lisp
(require 'julia-mode)
(add-hook 'julia-mode-hook 'my-Julia-mode-hook)
(defun my-Julia-mode-hook()
  (local-set-key (kbd "C-c C-p") 'inferior-julia-shell)
  (local-set-key (kbd "C-c C-r") 'julia-shell-run-region)
  (local-set-key (kbd "H-M-p") 'my/julia-compile) 
  )
#+END_SRC

Compile command for Julia
#+BEGIN_SRC emacs-lisp
(defun my/julia-compile()
  (interactive)
  (defvar thisfile buffer-file-name)
  (shell-command (concat "julia " thisfile)))
#+END_SRC

*** Shell Configurations

load in Julia compiler
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/elpa/julia-mode-20171116.642")
#+END_SRC

Julia shell
#+BEGIN_SRC emacs-lisp
(setq  inferior-julia-program-name "~/bin/julia/bin/julia")
#+END_SRC

Julia repel stuff
#+BEGIN_SRC emacs-lisp
(defun julia-repl ()
  "Runs Julia in a screen session in a `term' buffer."
  (interactive)
  (require 'term)
  (let ((termbuf (apply 'make-term "Julia REPL" "screen" nil (split-string-and-unquote "julia"))))
    (set-buffer termbuf)
    (term-mode)
    (term-char-mode)
    (switch-to-buffer termbuf)))
(global-set-key (kbd "C-x j") 'julia-repl)
#+END_SRC

* Org
