config.html

<div id="outline-container-orgbc61bae" class="outline-3">
<h3 id="orgbc61bae"><span class="section-number-3">7.2</span> Python</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Insert a template for a python document
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-hook 'find-file-hooks 'my/template-insert-python<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">my/template-insert-python</span><span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">when</span> <span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">and</span>
  <span style="color: #E6DB74;">(</span>string-match <span style="color: #ff00ff;">"\\.py$"</span> <span style="color: #FD971F;">(</span>buffer-file-name<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
  <span style="color: #E6DB74;">(</span>eq 1 <span style="color: #FD971F;">(</span>point-max<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
  <span style="color: #A6E22E;">(</span>insert-file <span style="color: #ff00ff;">"~/Dropbox/Templates/python_template.py"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>    
</pre>
</div>

<p>
Some configurations Python major mode
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #ee2c2c;">python</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-hook 'python-mode-hook 'my-python-mode-hook<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">my-python-mode-hook</span><span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>     
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> python-shell-interpreter <span style="color: #ff00ff;">"ipython"</span>
        python-shell-interpreter-args <span style="color: #ff00ff;">"--simple-prompt -i"</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>add-to-list 'load-path <span style="color: #ff00ff;">"/folder/containing/file"</span><span style="color: #66D9EF;">)</span>
  <span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3a03fc" class="outline-3">
<h3 id="orgf3a03fc"><span class="section-number-3">7.3</span> C++</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Load in C++ major mode for .h files
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-to-list 'auto-mode-alist '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"\\.h\\'"</span> . c++-mode<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Insert a template for a C++ document
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-hook 'find-file-hooks 'my/template-insert-C++<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">my/template-insert-C++</span><span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">when</span> <span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">and</span>
  <span style="color: #E6DB74;">(</span>string-match <span style="color: #ff00ff;">"\\.cpp$"</span> <span style="color: #FD971F;">(</span>buffer-file-name<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
  <span style="color: #E6DB74;">(</span>eq 1 <span style="color: #FD971F;">(</span>point-max<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
  <span style="color: #A6E22E;">(</span>insert-file <span style="color: #ff00ff;">"~/Dropbox/Templates/c++template.cpp"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>    
</pre>
</div>

<p>
Some configurations C++ major mode
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #ee2c2c;">cl</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-hook 'c++-mode-hook 'my-c++-mode-hook<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">my-c++-mode-hook</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>local-set-key <span style="color: #A6E22E;">(</span>kbd <span style="color: #ff00ff;">"H-M-p"</span><span style="color: #A6E22E;">)</span><span style="color: #A6E22E;">(</span><span style="color: #00ffff; font-weight: bold;">lambda</span> <span style="color: #E6DB74;">(</span><span style="color: #E6DB74;">)</span> <span style="color: #E6DB74;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #E6DB74;">)</span> <span style="color: #E6DB74;">(</span>shell-command <span style="color: #ff00ff;">"./bash_c++"</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgacaf4e8" class="outline-3">
<h3 id="orgacaf4e8"><span class="section-number-3">7.4</span> Julia</h3>
<div class="outline-text-3" id="text-7-4">
</div>
<div id="outline-container-org8e4b799" class="outline-4">
<h4 id="org8e4b799"><span class="section-number-4">7.4.1</span> Environment Macros</h4>
<div class="outline-text-4" id="text-7-4-1">
<p>
Some configurations Julia major mode
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #ee2c2c;">julia-mode</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-hook 'julia-mode-hook 'my-Julia-mode-hook<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">my-Julia-mode-hook</span><span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>local-set-key <span style="color: #A6E22E;">(</span>kbd <span style="color: #ff00ff;">"C-c C-p"</span><span style="color: #A6E22E;">)</span> 'inferior-julia-shell<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>local-set-key <span style="color: #A6E22E;">(</span>kbd <span style="color: #ff00ff;">"C-c C-r"</span><span style="color: #A6E22E;">)</span> 'julia-shell-run-region<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>local-set-key <span style="color: #A6E22E;">(</span>kbd <span style="color: #ff00ff;">"H-M-p"</span><span style="color: #A6E22E;">)</span> 'my/julia-compile<span style="color: #66D9EF;">)</span> 
  <span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Compile command for Julia
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">my/julia-compile</span><span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">defvar</span> <span style="color: #ffc125;">thisfile</span> buffer-file-name<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>shell-command <span style="color: #A6E22E;">(</span>concat <span style="color: #ff00ff;">"julia "</span> thisfile<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f20df1" class="outline-4">
<h4 id="org1f20df1"><span class="section-number-4">7.4.2</span> Shell Configurations</h4>
<div class="outline-text-4" id="text-7-4-2">
<p>
load in Julia compiler
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-to-list 'load-path <span style="color: #ff00ff;">"~/.emacs.d/elpa/julia-mode-20171116.642"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Julia shell
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span>  inferior-julia-program-name <span style="color: #ff00ff;">"~/bin/julia/bin/julia"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Julia repel stuff
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">julia-repl</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #E6DB74;">"Runs Julia in a screen session in a `</span><span style="color: #ee2c2c;">term</span><span style="color: #E6DB74;">' buffer."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #ee2c2c;">term</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">let</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>termbuf <span style="color: #FD971F;">(</span>apply 'make-term <span style="color: #ff00ff;">"Julia REPL"</span> <span style="color: #ff00ff;">"screen"</span> nil <span style="color: #F92672;">(</span>split-string-and-unquote <span style="color: #ff00ff;">"julia"</span><span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span>set-buffer termbuf<span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span>term-mode<span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span>term-char-mode<span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span>switch-to-buffer termbuf<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"C-x j"</span><span style="color: #66D9EF;">)</span> 'julia-repl<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
