config.org
** Editing Code

Some configurations Org major mode
#+BEGIN_SRC emacs-lisp
(defun my-org-mode-hook ()
  (setq org-log-done t)
  (define-key global-map "\C-cl" 'org-store-link)
  (define-key global-map "\C-ca" 'org-agenda)
  (visual-line-mode 1)
  (org-indent-mode 1)
  (org-bullets-mode 1)
  (abbrev-mode 1)
  ;; (linum-mode 1)
)
#+END_SRC

load mode
#+BEGIN_SRC emacs-lisp
(autoload 'org-mode "org" "Org Mode" t)
(add-hook 'org-mode-hook 'my-org-mode-hook)
#+END_SRC

load in certain languages coding modes
#+BEGIN_SRC emacs-lisp
(require 'ob-clojure)
(require 'ox-latex)
(require 'org)
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (python . t)
   (fortran . t)
   (latex . t)
   (shell . t)
   (julia . t)
   (emacs-lisp . t)
   ))
#+END_SRC

** Capture Mode

add custom section titles templates
#+BEGIN_SRC emacs-lisp
    (setq org-capture-templates
          (quote (("m" "Meeting Notes" entry (file+olp+datetree "~/Dropbox/Journal/journal.org")
                   "* %? :Meeting: \n\n_Notes_:  \n \n_Agenda_: \n \n_Resources_: ")
                  ("j" "Journal" entry (file+olp+datetree "~/Dropbox/Journal/journal.org")
                   "* %? \n\n_Notes_:  \n \n_Resources_:")
                  ("r" "Research Talk" entry (file+olp+datetree "~/Dropbox/Journal/journal.org")
                   "* %? :RT: \n\n_Notes_:  \n \n_Resources_:")
                  ("Q" "Meeting Question" entry (file+olp+datetree "~/Dropbox/Journal/questions.org")
                   "* %?")
                  )))
#+END_SRC

Tell org where the agenda files are
#+BEGIN_SRC emacs-lisp
(setq org-agenda-files 
  (list "~/Dropbox/Journal/agenda.org" "~/Dropbox/Journal/journal.org"))  
#+END_SRC

** Macros

Keyboard macros for org mode
#+BEGIN_SRC emacs-lisp
   (global-set-key (kbd "C-c l") 'org-store-link)
   (global-set-key (kbd "C-c a") 'org-agenda)
   (global-set-key (kbd "C-c c") 'org-capture)
#+END_SRC

Code block macros
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-structure-template-alist
               '("el" "#+BEGIN_SRC emacs-lisp\n  ?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("c" "#+BEGIN_SRC C++\n  ?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("py" "#+BEGIN_SRC python
  #!/usr/bin/python3.5
  import matplotlib.pyplot as pypl
  import numpy as np
  import math as m
  from matplotlib import rc
  ?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("ipy" "#+BEGIN_SRC ipython :session :exports both :results raw drawer\n  ?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("f" "#+BEGIN_SRC fortran\n  ?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("y" "#+BEGIN_SRC yaml\n  ?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("sh" "#+BEGIN_SRC shell\n  ?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("t" "#+BEGIN_SRC text\n  ?\n#+END_SRC"))
#+END_SRC

** Utility

Translate regular ol' straight quotes to typographically-correct curly quotes
when exporting.
#+BEGIN_SRC emacs-lisp
   (setq org-export-with-smart-quotes t)
#+END_SRC

Don't ask before evaluating code blocks.
#+BEGIN_SRC emacs-lisp
   (setq org-confirm-babel-evaluate nil)
#+END_SRC

For exporting to HTML
#+BEGIN_SRC emacs-lisp
(require  'htmlize)
#+END_SRC

