config.html

<div id="outline-container-org094fffa" class="outline-2">
<h2 id="org094fffa"><span class="section-number-2">8</span> Org</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org1ecd6d6" class="outline-3">
<h3 id="org1ecd6d6"><span class="section-number-3">8.1</span> Editing Code</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Some configurations Org major mode
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #00ff7f;">my-org-mode-hook</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-log-done t<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>define-key global-map <span style="color: #ff00ff;">"\C-cl"</span> 'org-store-link<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>define-key global-map <span style="color: #ff00ff;">"\C-ca"</span> 'org-agenda<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>visual-line-mode 1<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>org-indent-mode 1<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>org-bullets-mode 1<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>abbrev-mode 1<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">;; </span><span style="color: #999999; font-style: italic;">(linum-mode 1)</span>
<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
load mode
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>autoload 'org-mode <span style="color: #ff00ff;">"org"</span> <span style="color: #E6DB74;">"Org Mode"</span> t<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-hook 'org-mode-hook 'my-org-mode-hook<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
load in certain languages coding modes
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #ee2c2c;">ob-clojure</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #ee2c2c;">ox-latex</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #ee2c2c;">org</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>org-babel-do-load-languages
 'org-babel-load-languages
 '<span style="color: #66D9EF;">(</span>
   <span style="color: #A6E22E;">(</span>python . t<span style="color: #A6E22E;">)</span>
   <span style="color: #A6E22E;">(</span>fortran . t<span style="color: #A6E22E;">)</span>
   <span style="color: #A6E22E;">(</span>latex . t<span style="color: #A6E22E;">)</span>
   <span style="color: #A6E22E;">(</span>shell . t<span style="color: #A6E22E;">)</span>
   <span style="color: #A6E22E;">(</span>julia . t<span style="color: #A6E22E;">)</span>
   <span style="color: #A6E22E;">(</span>emacs-lisp . t<span style="color: #A6E22E;">)</span>
   <span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org777e797" class="outline-3">
<h3 id="org777e797"><span class="section-number-3">8.2</span> Capture Mode</h3>
<div class="outline-text-3" id="text-8-2">
<p>
add custom section titles templates
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-capture-templates
      <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">quote</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span><span style="color: #ff00ff;">"m"</span> <span style="color: #ff00ff;">"Meeting Notes"</span> entry <span style="color: #FD971F;">(</span>file+olp+datetree <span style="color: #ff00ff;">"~/Dropbox/Journal/journal.org"</span><span style="color: #FD971F;">)</span>
               <span style="color: #ff00ff;">"* %? :Meeting: \n\n _Notes_:  \n \n _Agenda_: \n \n _Resources_: "</span><span style="color: #E6DB74;">)</span>
              <span style="color: #E6DB74;">(</span><span style="color: #ff00ff;">"j"</span> <span style="color: #ff00ff;">"Journal"</span> entry <span style="color: #FD971F;">(</span>file+olp+datetree <span style="color: #ff00ff;">"~/Dropbox/Journal/journal.org"</span><span style="color: #FD971F;">)</span>
               <span style="color: #ff00ff;">"* %? \n\n _Notes_:  \n \n _Resources_:"</span><span style="color: #E6DB74;">)</span>
              <span style="color: #E6DB74;">(</span><span style="color: #ff00ff;">"r"</span> <span style="color: #ff00ff;">"Research Talk"</span> entry <span style="color: #FD971F;">(</span>file+olp+datetree <span style="color: #ff00ff;">"~/Dropbox/Journal/journal.org"</span><span style="color: #FD971F;">)</span>
               <span style="color: #ff00ff;">"* %? :RT: \n\n _Notes_:  \n \n _Resources_:"</span><span style="color: #E6DB74;">)</span>
              <span style="color: #E6DB74;">(</span><span style="color: #ff00ff;">"Q"</span> <span style="color: #ff00ff;">"Meeting Question"</span> entry <span style="color: #FD971F;">(</span>file+olp+datetree <span style="color: #ff00ff;">"~/Dropbox/Journal/questions.org"</span><span style="color: #FD971F;">)</span>
               <span style="color: #ff00ff;">"* %?"</span><span style="color: #E6DB74;">)</span>
              <span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Tell org where the agenda files are
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-files 
  <span style="color: #66D9EF;">(</span>list <span style="color: #ff00ff;">"~/Dropbox/Journal/agenda.org"</span> <span style="color: #ff00ff;">"~/Dropbox/Journal/journal.org"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>  
</pre>
</div>
</div>
</div>

<div id="outline-container-org11a47e1" class="outline-3">
<h3 id="org11a47e1"><span class="section-number-3">8.3</span> Macros</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Keyboard macros for org mode
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"C-c l"</span><span style="color: #66D9EF;">)</span> 'org-store-link<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"C-c a"</span><span style="color: #66D9EF;">)</span> 'org-agenda<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #66D9EF;">(</span>kbd <span style="color: #ff00ff;">"C-c c"</span><span style="color: #66D9EF;">)</span> 'org-capture<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Code block macros
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-to-list 'org-structure-template-alist
             '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"el"</span> <span style="color: #ff00ff;">"#+BEGIN_SRC emacs-lisp\n  ?\n#+END_SRC"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-to-list 'org-structure-template-alist
             '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"c"</span> <span style="color: #ff00ff;">"#+BEGIN_SRC C++\n  ?\n#+END_SRC"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-to-list 'org-structure-template-alist
             '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"py"</span> <span style="color: #ff00ff;">"#+BEGIN_SRC python</span>
<span style="color: #ff00ff;">#!/usr/bin/python3.5</span>
<span style="color: #ff00ff;">import matplotlib.pyplot as pypl</span>
<span style="color: #ff00ff;">import numpy as np</span>
<span style="color: #ff00ff;">import math as m</span>
<span style="color: #ff00ff;">from matplotlib import rc</span>
<span style="color: #ff00ff;">?\n#+END_SRC"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-to-list 'org-structure-template-alist
             '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"ipy"</span> <span style="color: #ff00ff;">"#+BEGIN_SRC ipython :session :exports both :results raw drawer\n  ?\n#+END_SRC"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-to-list 'org-structure-template-alist
             '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"f"</span> <span style="color: #ff00ff;">"#+BEGIN_SRC fortran\n  ?\n#+END_SRC"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-to-list 'org-structure-template-alist
             '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"y"</span> <span style="color: #ff00ff;">"#+BEGIN_SRC yaml\n  ?\n#+END_SRC"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-to-list 'org-structure-template-alist
             '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"sh"</span> <span style="color: #ff00ff;">"#+BEGIN_SRC shell\n  ?\n#+END_SRC"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-to-list 'org-structure-template-alist
             '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"t"</span> <span style="color: #ff00ff;">"#+BEGIN_SRC text\n  ?\n#+END_SRC"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org80c7b0b" class="outline-3">
<h3 id="org80c7b0b"><span class="section-number-3">8.4</span> Utility</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Translate regular ol&rsquo; straight quotes to typographically-correct curly quotes
when exporting.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-export-with-smart-quotes t<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Don&rsquo;t ask before evaluating code blocks.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-confirm-babel-evaluate nil<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
For exporting to HTML
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">require</span>  '<span style="color: #ee2c2c;">htmlize</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
