config.org
** Visual Settings

Nice ellipsis:
#+BEGIN_SRC emacs-lisp
   (setq org-ellipsis "⤵")
#+END_SRC

Use syntax highlighting in source blocks while editing (you may already have this).
#+BEGIN_SRC emacs-lisp
   (setq org-src-fontify-natively t)
#+END_SRC

When editing a code snippet, use the current window rather than popping open a new one.
#+BEGIN_SRC emacs-lisp
   (setq org-src-window-setup 'current-window)
#+END_SRC

Automatic indentation upon startup (or set to nil if you don't want it)
#+BEGIN_SRC emacs-lisp
  (setq org-startup-indented t)
#+END_SRC

Change Org bullets appearance
#+BEGIN_SRC emacs-lisp
(setq org-bullets-face-name (quote org-bullet-face))
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
(setq org-bullets-bullet-list '("➢" "➣" "➤" "➟" "➙" "»")) 
#+END_SRC

** Agenda alternations

Add states for to do lists
#+BEGIN_SRC emacs-lisp 
  (setq org-todo-keywords '((sequence "☛ TODO(t)" "|" "✔ DONE(d)") ;
                            (sequence "⚑ WAITING(w)" "|")
                            (sequence "|" "💀 DEAD(d)")
                            ))
#+END_SRC

** Beamer

Some code to allow the use of Beamer in org mode
#+BEGIN_SRC emacs-lisp
; allow for export=>beamer by placing

;; #+LaTeX_CLASS: beamer in org files
(unless (boundp 'org-export-latex-classes)
  (setq org-export-latex-classes nil))
(add-to-list 'org-export-latex-classes
  ;; beamer class, for presentations
  '("beamer"
     "\\documentclass[11pt]{beamer}\n
      \\mode<{{{beamermode}}}>\n
      \\usetheme{{{{beamertheme}}}}\n
      \\usecolortheme{{{{beamercolortheme}}}}\n
      \\beamertemplateballitem\n
      \\setbeameroption{show notes}
      \\usepackage[utf8]{inputenc}\n
      \\usepackage[T1]{fontenc}\n
      \\usepackage{hyperref}\n
      \\usepackage{color}
      \\usepackage{listings}
      \\lstset{numbers=none,language=[ISO]C++,tabsize=4,
  frame=single,
  basicstyle=\\small,
  showspaces=false,showstringspaces=false,
  showtabs=false,
  keywordstyle=\\color{blue}\\bfseries,
  commentstyle=\\color{red},
  }\n
      \\usepackage{verbatim}\n
      \\institute{{{{beamerinstitute}}}}\n          
       \\subject{{{{beamersubject}}}}\n"

     ("\\section{%s}" . "\\section*{%s}")
     
     ("\\begin{frame}[fragile]\\frametitle{%s}"
       "\\end{frame}"
       "\\begin{frame}[fragile]\\frametitle{%s}"
       "\\end{frame}")))

  ;; letter class, for formal letters

  (add-to-list 'org-export-latex-classes

  '("letter"
     "\\documentclass[11pt]{letter}\n
      \\usepackage[utf8]{inputenc}\n
      \\usepackage[T1]{fontenc}\n
      \\usepackage{color}"
     
     ("\\section{%s}" . "\\section*{%s}")
     ("\\subsection{%s}" . "\\subsection*{%s}")
     ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
     ("\\paragraph{%s}" . "\\paragraph*{%s}")
     ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+END_SRC

Beamer template 
#+BEGIN_SRC emacs-lisp
    (add-to-list 'org-structure-template-alist
    '("beamer" "#+TITLE: \n#+AUTHOR: Anthony Kalaitzis \n#+OPTIONS: H:2 toc:t num:t \n#+LATEX_CLASS: beamer \n#+LATEX_CLASS_OPTIONS: [presentation] \n#+LATEX_header: \n#+BEAMER_header: \\usetheme{Berlin} \n#+BEAMER_header: \\usecolortheme[named=purple]{structure} \n#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt) \n?"))
#+END_SRC

** LaTeX

Use =mypackage= package for all LaTeX exports.
#+BEGIN_SRC emacs-lisp
(setq org-latex-packages-alist '())
(add-to-list 'org-latex-packages-alist '("" "mypackage" t))
#+END_SRC

Tell org where to find LaTeX
#+BEGIN_SRC emacs-lisp
  (setq exec-path (append exec-path '("/usr/bin")))
  (load "auctex.el" nil t t)
#+END_SRC

