config.html

<div id="outline-container-org2fe7a6c" class="outline-3">
<h3 id="org2fe7a6c"><span class="section-number-3">8.5</span> Visual Settings</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Nice ellipsis:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-ellipsis <span style="color: #ff00ff;">"&#10549;"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Use syntax highlighting in source blocks while editing (you may already have this).
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-src-fontify-natively t<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
When editing a code snippet, use the current window rather than popping open a new one.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-src-window-setup 'current-window<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Automatic indentation upon startup (or set to nil if you don&rsquo;t want it)
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-startup-indented t<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Change Org bullets appearance
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-bullets-face-name <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">quote</span> org-bullet-face<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-hook 'org-mode-hook <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">lambda</span> <span style="color: #A6E22E;">(</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">(</span>org-bullets-mode 1<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-bullets-bullet-list '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"&#10146;"</span> <span style="color: #ff00ff;">"&#10147;"</span> <span style="color: #ff00ff;">"&#10148;"</span> <span style="color: #ff00ff;">"&#10143;"</span> <span style="color: #ff00ff;">"&#10137;"</span> <span style="color: #ff00ff;">"&#187;"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> 
</pre>
</div>
</div>
</div>

<div id="outline-container-orge0c0ab5" class="outline-3">
<h3 id="orge0c0ab5"><span class="section-number-3">8.6</span> Agenda alternations</h3>
<div class="outline-text-3" id="text-8-6">
<p>
Add states for to do lists
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-todo-keywords '<span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>sequence <span style="color: #ff00ff;">"&#9755; TODO(t)"</span> <span style="color: #ff00ff;">"|"</span> <span style="color: #ff00ff;">"&#10004; DONE(d)"</span><span style="color: #A6E22E;">)</span> <span style="color: #75715E;">;</span>
                          <span style="color: #A6E22E;">(</span>sequence <span style="color: #ff00ff;">"&#9873; WAITING(w)"</span> <span style="color: #ff00ff;">"|"</span><span style="color: #A6E22E;">)</span>
                          <span style="color: #A6E22E;">(</span>sequence <span style="color: #ff00ff;">"|"</span> <span style="color: #ff00ff;">"&#128128; DEAD(d)"</span><span style="color: #A6E22E;">)</span>
                          <span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f1e7bc" class="outline-3">
<h3 id="org2f1e7bc"><span class="section-number-3">8.7</span> Beamer</h3>
<div class="outline-text-3" id="text-8-7">
<p>
Some code to allow the use of Beamer in org mode
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #75715E;">; </span><span style="color: #999999; font-style: italic;">allow for export=&gt;beamer by placing</span>

<span style="color: #75715E;">;; </span><span style="color: #999999; font-style: italic;">#+LaTeX_CLASS: beamer in org files</span>
<span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">unless</span> <span style="color: #66D9EF;">(</span>boundp 'org-export-latex-classes<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-export-latex-classes nil<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-to-list 'org-export-latex-classes
  <span style="color: #75715E;">;; </span><span style="color: #999999; font-style: italic;">beamer class, for presentations</span>
  '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"beamer"</span>
     <span style="color: #ff00ff;">"\\documentclass[11pt]{beamer}\n</span>
<span style="color: #ff00ff;">      \\mode&lt;{{{beamermode}}}&gt;\n</span>
<span style="color: #ff00ff;">      \\usetheme{{{{beamertheme}}}}\n</span>
<span style="color: #ff00ff;">      \\usecolortheme{{{{beamercolortheme}}}}\n</span>
<span style="color: #ff00ff;">      \\beamertemplateballitem\n</span>
<span style="color: #ff00ff;">      \\setbeameroption{show notes}</span>
<span style="color: #ff00ff;">      \\usepackage[utf8]{inputenc}\n</span>
<span style="color: #ff00ff;">      \\usepackage[T1]{fontenc}\n</span>
<span style="color: #ff00ff;">      \\usepackage{hyperref}\n</span>
<span style="color: #ff00ff;">      \\usepackage{color}</span>
<span style="color: #ff00ff;">      \\usepackage{listings}</span>
<span style="color: #ff00ff;">      \\lstset{numbers=none,language=[ISO]C++,tabsize=4,</span>
<span style="color: #ff00ff;">  frame=single,</span>
<span style="color: #ff00ff;">  basicstyle=\\small,</span>
<span style="color: #ff00ff;">  showspaces=false,showstringspaces=false,</span>
<span style="color: #ff00ff;">  showtabs=false,</span>
<span style="color: #ff00ff;">  keywordstyle=\\color{blue}\\bfseries,</span>
<span style="color: #ff00ff;">  commentstyle=\\color{red},</span>
<span style="color: #ff00ff;">  }\n</span>
<span style="color: #ff00ff;">      \\usepackage{verbatim}\n</span>
<span style="color: #ff00ff;">      \\institute{{{{beamerinstitute}}}}\n          </span>
<span style="color: #ff00ff;">       \\subject{{{{beamersubject}}}}\n"</span>

     <span style="color: #A6E22E;">(</span><span style="color: #ff00ff;">"\\section{%s}"</span> . <span style="color: #ff00ff;">"\\section*{%s}"</span><span style="color: #A6E22E;">)</span>

     <span style="color: #A6E22E;">(</span><span style="color: #ff00ff;">"\\begin{frame}[fragile]\\frametitle{%s}"</span>
       <span style="color: #ff00ff;">"\\end{frame}"</span>
       <span style="color: #ff00ff;">"\\begin{frame}[fragile]\\frametitle{%s}"</span>
       <span style="color: #ff00ff;">"\\end{frame}"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

  <span style="color: #75715E;">;; </span><span style="color: #999999; font-style: italic;">letter class, for formal letters</span>

  <span style="color: #AE81FF;">(</span>add-to-list 'org-export-latex-classes

  '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"letter"</span>
     <span style="color: #ff00ff;">"\\documentclass[11pt]{letter}\n</span>
<span style="color: #ff00ff;">      \\usepackage[utf8]{inputenc}\n</span>
<span style="color: #ff00ff;">      \\usepackage[T1]{fontenc}\n</span>
<span style="color: #ff00ff;">      \\usepackage{color}"</span>

     <span style="color: #A6E22E;">(</span><span style="color: #ff00ff;">"\\section{%s}"</span> . <span style="color: #ff00ff;">"\\section*{%s}"</span><span style="color: #A6E22E;">)</span>
     <span style="color: #A6E22E;">(</span><span style="color: #ff00ff;">"\\subsection{%s}"</span> . <span style="color: #ff00ff;">"\\subsection*{%s}"</span><span style="color: #A6E22E;">)</span>
     <span style="color: #A6E22E;">(</span><span style="color: #ff00ff;">"\\subsubsection{%s}"</span> . <span style="color: #ff00ff;">"\\subsubsection*{%s}"</span><span style="color: #A6E22E;">)</span>
     <span style="color: #A6E22E;">(</span><span style="color: #ff00ff;">"\\paragraph{%s}"</span> . <span style="color: #ff00ff;">"\\paragraph*{%s}"</span><span style="color: #A6E22E;">)</span>
     <span style="color: #A6E22E;">(</span><span style="color: #ff00ff;">"\\subparagraph{%s}"</span> . <span style="color: #ff00ff;">"\\subparagraph*{%s}"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Beamer template 
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-to-list 'org-structure-template-alist
'<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">"beamer"</span> <span style="color: #ff00ff;">"#+TITLE: \n#+AUTHOR: Anthony Kalaitzis \n#+OPTIONS: H:2 toc:t num:t \n#+LATEX_CLASS: beamer \n#+LATEX_CLASS_OPTIONS: [presentation] \n#+LATEX_header: \n#+BEAMER_header: \\usetheme{Berlin} \n#+BEAMER_header: \\usecolortheme[named=purple]{structure} \n#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt) \n?"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org735aa9e" class="outline-3">
<h3 id="org735aa9e"><span class="section-number-3">8.8</span> LaTeX</h3>
<div class="outline-text-3" id="text-8-8">
<p>
Use <code>mypackage</code> package for all LaTeX exports.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> org-latex-packages-alist '<span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>add-to-list 'org-latex-packages-alist '<span style="color: #66D9EF;">(</span><span style="color: #ff00ff;">""</span> <span style="color: #ff00ff;">"mypackage"</span> t<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Tell org where to find LaTeX
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #00ffff; font-weight: bold;">setq</span> exec-path <span style="color: #66D9EF;">(</span>append exec-path '<span style="color: #A6E22E;">(</span><span style="color: #ff00ff;">"/usr/bin"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>load <span style="color: #ff00ff;">"auctex.el"</span> nil t t<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>
